#!/usr/bin/perl -w
use strict;
use utf8;
binmode(STDIN, ':utf8');

#Символ 3 обнаружен на позициях (13, 1), (13, 7), (13, 13), (13, 19), (13, 25), (13, 31), (13, 37), (13, 43), (13, 49), (13, 55), (54, 1), (54, 7), (54, 13), (54, 19), (54, 25), (54, 31), (54, 37), (54, 43), (54, 49), (54, 55), (95, 1), (95, 7), (95, 13), (95, 19), (95, 25), (95, 31), (95, 37), (95, 43), (95, 49), (95, 55).

my %h;
my $pat = qr/(\d+), (\d+)/;
while(<>){
    next unless /Символ (\d) обнаружен на позициях (.+)\./;

    my $digit = $1;
    my @pos = split /\), \(/, $2;

    foreach(@pos){
        next unless $_ =~ $pat;
        $h{$2}{$1} = $digit;
    }
}

foreach my $x(sort { $a <=> $b } keys %h){
    my $row = $h{$x};
    foreach my $y(sort { $a <=> $b } keys %$row){
        print $h{$x}{$y};
    }
}
